project/app/views/web_test/welcome/shared/_form.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."dynamic_id" = $1  [["dynamic_id", 2]]
---

    <% if @dynamic.reviews.present? %>