project/app/controllers/web_test/welcome_controller.rb

  def find_dynamic_by_name(name)
    return cont_dynamic.find_dynamic_by_name(name)
---
SELECT "dynamics".* FROM "dynamics" WHERE "dynamics"."name" = $1 LIMIT $2  [["name", "testewerewrewrewr"], ["LIMIT", 1]]

  def delete_all_reviews
    @dynamic.reviews.each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."dynamic_id" = $1  [["dynamic_id", 1]]