project/app/helpers/web_test/welcome_helper.rb

SELECT "reviews"."note" FROM "reviews" WHERE "reviews"."dynamic_id" = $1  [["dynamic_id", 4]]
---
  def media(dynamic)
    notes = dynamic.reviews.pluck(:note)